[
  {
    "id": 1761855753374,
    "title": "L21 Study of Modern Day Prophets",
    "text": "Lesson 21: The Study of Modern Day Prophets/Citation Index TAKING TIME WITH THE TOOL (SCRIPTURES) Tool Techniques: Part 1: What is one significant truth you gleaned from studying the lesson material (tool task) that will enhance your understanding as a student of the scriptures? I still struggle with some of the things that were done by past prophets and apostles. They were not perfect, and they had their own struggles. We know that the Lord will not allow them to lead the church astray. I will hold my own grievances with past and present prophets, because I know that they are chosen by the Lord to lead. As I study their words, I will read them as though they come from the mouth of the Lord himself. It is scripture. Part 2: Read and study a message from a member of the Quorum of the Twelve Apostles or First Presidency from last general conference. Apply at least 3 tools or any combinations of tools/techniques we have learned through the semester to the message you read. Be sure to include and write about your findings in your tool tracker study journal. What did you learn from your skill use? Elder Ronald A. Rasband: Right Before Our Eyes Footnotes The sixth footnote leads to Ether 12:41, which tells us to seek Jesus, and allow him to abide in us forever. This is an interesting scripture to link because he is talking about church education being at a new high. We are seekers of Jesus. We choose to attend church school, not just for the temporal benefits but also to find Jesus. Name Sub [Melissa] is known as a disciple of Jesus Christ. She shares her testimony of Him, His Church, His ways, and His covenant path. She is His people, and He is her Savior. Word Definitions Elder Rasband gives the definition for Hastening, as moving quickly, accelerating, and urgency. I would also add that for me when used in the context of gathering Israel, hastening also conveys motion, a motion that cannot be stopped. He uses the word unprecedented to describe the growth of the church. Looking it up it means never done or known before. This is truly something that has never occurred in the history of the world. This growth shows that God is leading this church, because only he could cause such a great movement.",
    "createdAt": "2025-10-30T20:22:33.374Z",
    "updatedAt": "2025-10-30T20:24:51.294Z"
  },
  {
    "id": 1761856963423,
    "title": "L20 Seeking Christ in Scripture2",
    "text": "Lesson 20: Seeking Christ in Scripture TAKING TIME WITH THE TOOL (SCRIPTURES) Keep track of tool technique practice in your study journal (tool tracker). Tool Techniques: Part 1: What is one significant truth you gleaned from studying the lesson material (tool task) that will enhance your understanding as a student of the scriptures? I should always be looking for Christ in what I study. For all things in this church teach of him. It is something that I try to do, but not with as much effort as I should. I will begin to ask myself every time, where is Jesus in this passage, and what does that mean to me. If I do consistently, I believe that it will be much easier for me to find the Savior in my daily life. Part 2: Using the Topical Guide under \"Jesus Christ\" and other locations, find a few scripture passage(s) for each of the following activities and read them thoroughly: Find a prophet that 'TESTIFIES of Christ' (Ex. Jacob 7:10-11; Mosiah 13:33-35; Helaman 8:16-20) Pick a 'TITLE of Christ,' and read all references listed with it (Ex. Good Shepherd, Gen. 49:24 -- Mormon 5:17) Find someone or something that 'TYPIFIES Christ' and read it. (Ex. High Priest: Heb. 5:1-3; Husbands: 5:25-28; Abraham/Isaac Gen. 22) What prophet did you select, and what did you learn from their testimony of Jesus? Isaiah: When speaking about the savior Isaiah uses present tense. He isn’t just predicting the coming of the Messiah and the blessings he will bring with him. But he speaks presently, because Jesus Christ is and always has been, and always will be. He is the great I AM, and his blessings extended from the beginning of the world past the end. What title did you select, and how does that Title help you come unto the Savior? Light of the World: Light and Darkness are incredibly interesting opposites. Light is warm, darkness is cold. Light is knowledge, darkness is ignorance. Light is spacious, darkness is inclosing. Light is safe, darkness is dangerous. So it is that we treasure light. We need it, without we would cease to be. We need Jesus, without him we would cease to be. He is the light. We can find Jesus, and come unto him when we identify sources of light. Actions and things that are good and make us feel good, are sources of the Savior. Because He is good. Who did you pick that typifies Christ? How does she/he/it typify Him? Explain Abraham sacrificing his son Isaac: This event is almost a one to one with the Father and the Son. Heavenly Father sent his only begotten son Jesus, to suffer for the sins of the world, and to die that men may again live. Abraham was commanded that he had to sacrifice his only son for the Lord. Because of Abraham’s faithfulness in this God blessed him with the covenant. Heavenly Father gives us Jesus as the sacrifice for us, and in return we are a part of the covenant, we have the opportunity to receive exaltation. *Invitation: Look to find Christ as you study the scriptures.",
    "createdAt": "2025-10-30T20:42:43.423Z"
  },
  {
    "id": 1761857226040,
    "title": "Informational Interview Report",
    "text": "Informational Interview Report Name: Melissa Dickerson Who did you interview? Mark Vagil Where do they work? (or are they self-employed) Amazon What is their current position? Software Dev Engineer When did you meet? (date) 5/5/2025 How did you meet? (in person, Zoom, etc.) Phone To secure my interview with Mark, I reached out to him through LinkedIn. I saw that he was an alumni of BYU-I and sent him a message asking to chat with him. His position as a software dev interested me, and so I prepared a few questions to ask him. He was kind enough to agree to talk with me and we scheduled a time to call. I used LinkedIn a lot over this past semester. I created new connections and sent messages to people in careers that I like and if they are willing to talk with me, I will go through my basic informational script, adapting it to each person that I talk with. After my multiple interviews I have buckets of amazing information, I now have a path to success in finding a job. Such as engaging in open source projects, working through LeetCode, building my portfolio with projects I enjoy. I am less afraid of reaching out to strangers about career opportunities. In the informational interview format, it feels less stressful because instead of asking for favors and jobs, I’m instead asking them to share their experiences, which I can then use.",
    "createdAt": "2025-10-30T20:47:06.040Z"
  },
  {
    "id": 1761935020932,
    "title": "New Note",
    "text": "This is a new note :)",
    "createdAt": "2025-10-31T18:23:40.932Z"
  },
  {
    "id": 1761935824290,
    "title": "Scripture Study Reflection Week 1",
    "text": "Scripture Study Reflection Week 1 Abraham 4 In Abraham 4, we learn about the creation of the earth and its order. How does this chapter illustrate God's deliberate and thoughtful creation of the world? How can you apply the principles of order and purpose in your life as you seek to fulfill your own divine potential? What does being created in God’s image mean to you personally, and how does understanding dominion as stewardship rather than control shape your approach to responsibilities? As I was reading through this chapter, I was struck by the word “Gods” being repeated. This likely refers to Heavenly Father and Jesus Christ, however It was a reminder that we too have the opportunity to be Gods and Goddesses. We are filled with divine potential and children of divine beings. We are created after order. And so, we should seek to maintain that order in our own lives. For me purposefully, being created in their image reminds me that this goes deeper than physical appearance. I am told frequently that I look like my family, that there is a familial connection. I have a familial connection with Heavenly Father, I am created to look like Him and Heavenly Mother. As a divine child I don’t really need control, I can trust my Heavenly Parents in that, and instead focus myself on learning and taking care of what they have given me. For me that’s the difference between stewardship and control. Genesis 3 The fall of Adam and Eve in Genesis 3 introduces the concepts of agency, temptation, and the consequences of sin. How does this chapter help you understand the relationship between agency and accountability? How can you apply the principle of choosing wisely to learn from Adam and Eve? Agency and accountability go hand in hand. If we are free to choose for ourselves, then we have to accept the consequences that come with each choice. Eve was tempted to eat the fruit of knowledge, and so her eyes were opened and brought new challenges. Though she and Adam tried to hide at first from their choice, they eventually accepted accountability and received the consequences both good and bad. What I learn most from their experience is to never hide from the Lord. If I make a mistake, He should be the first one I go to. If I choose wisely, then I can receive the blessings that go with that choice as well. Moses 4 Moses 4 expands on the consequences of the fall, focusing on Satan’s role in leading humanity astray. How does this chapter highlight the importance of recognizing temptation and resisting it? How can you strengthen your ability to recognize and avoid temptation in your own life? This chapter does well to show that while what Satan promises sounds good, He doesn’t tell you about the bad things that will come with it too. Satan tempting Adam first failing and then successfully tempting Eve shows that he is persistent, so resistance also has to be persistent. The serpent is also described as being subtle, so it is hard to recognize temptation when it appears. What I can do to strengthen my ability to recognize and avoid temptation is to first gain a better understanding of God’s laws. It is easier to recognize wrong, when I have a solid understanding of good. So, I will refocus and remember the covenants I have made with the Lord in the Temple and throughout my whole life. With a strong foundation I can compare and choose wisely to follow the Lord’s path.",
    "createdAt": "2025-10-31T18:37:04.290Z"
  },
  {
    "id": 1761942336567,
    "title": "Test",
    "text": "Test Test",
    "createdAt": "2025-10-31T20:25:36.567Z",
    "updatedAt": "2025-10-31T22:29:40.665Z"
  },
  {
    "id": 1761942344644,
    "title": "Postgres",
    "text": "Postgres Gendjadj67Brj@#",
    "createdAt": "2025-10-31T20:25:44.644Z"
  },
  {
    "id": 1761949691038,
    "title": "Title",
    "text": "This is a test note for the video",
    "createdAt": "2025-10-31T22:28:11.038Z"
  },
  {
    "id": 1761949730220,
    "title": "Final Lesson",
    "text": "Final Lesson Plan Melissa Dickerson Study: D&C 78 Doctrine: Plan of Salvation Principle: The Lord wants us to prepare for the millennium, so we need to keep the commandments and help the needy Opening: What does a perfect day look like? What do you see, what do you feel, what do you hear, what do you smell? What does a perfect eternity look like? What do you see, what do you hear, what do you feel, what do you smell? Who is with you? What do you notice? How are those two things different? How would you define what it was that made the perfect eternity different from the perfect? What’s missing from the perfect day? (Guide towards an answer like the celestial kingdom, Jesus, Heavenly Father, families). Read: D&C 78: 13-15 Tell before: Look for the main point that the Lord is trying to share. What’s the context for section 78? Look at verses 3-4 for help So, what do you think the main point of verses 13-15 is trying to get across? Read: Verse 13, foot under ensample What does the footnote in verse 13 under ensample say? Prepare for the Millennial reign. What do you think it means that the Lord is connecting the storehouse to the preparation for the millennium. (Try to live like you are already in the Celestial kingdom.) Read: D&C 78: 7-12 Tell before: Looking for the patterns. Example Patterns: Keep the commandments, Blessings and consequences Ask: While the storehouse is a great example of preparing for the millennium and keeping the commandments of the Lord. We don’t personally have to set those up. What does it mean that these verses were included in the Doctrine and Covenants? (We may not set up the storehouses, but we still need to help the poor and the needy) What are you going to do about that? Invitation: Think of something concrete that you can do to help the poor and needy around you. Do this today or sometime this week. Skills Used: Patterns / Repeated words: When I studied, I was looking for patterns and repeated words. I did this to try and find the meaning of why this section was included in our scriptures. Then during the lesson, I had them do the same thing, so that they could identify the principle and underlying core doctrine for themselves. Footnotes: As I was studying the section, every time a footnote came up I looked at it, to see if it would give me additional insight. During the lesson I had them look at a specific footnote, ensample in verse 13, because it gave me a lot insight when I was studying. They also were looking through the footnotes while we were discussing the verses. Visualization: When I studied by myself, I tried to visualize how a store house would work in the celestial kingdom, to see if I could see the reason behind its connection. I liked the insight I gained from this that I implemented it into the start of the lesson by having them envision to different things, a perfect day and a perfect eternity to start their thoughts going on how the storehouse and helping the poor connected to their vision of a perfect eternity. What I learned and would have done better: During this activity I learned that a good lesson should bend to the people you are teaching. I practiced giving this lesson with my friend and she took us in a completely different direction than I had planned. While giving it during class, it also went in a different direction. I learned a great deal from participating in all these different perspectives. Because of my practice with my friend, I changed some things up in my outline to allow for branching discussions and paths, this proved beneficial will teaching today in class. If I had the chance to do this over, I would have created a slide show for them to look at. That way the questions would have been visible and easy to understand. I had some difficultly forming my questions as well when I was speaking so having them written out and something to look at I think would have been a great aid ina my teaching.",
    "createdAt": "2025-10-31T22:28:50.221Z"
  }
]